erp3l/src/AccumulationRegisters/СтоимостьОС/СтоимостьОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьОС</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитываемаяСтоимостьНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизационнаяПремия</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимости</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПриростСтоимостиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ЗалоговаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительнаяСтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиКапитализацииРасходов</name>
    <type>
      <types>EnumRef.ВидыАналитикиКапитализацииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаКапитализацииРасходов</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПримененияЦелевогоФинансирования</name>
    <type>
      <types>EnumRef.ВариантыПримененияЦелевогоФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорректировкаСтоимостиНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипСтоимости</name>
    <type>
      <types>EnumRef.УдалитьТипыСтоимостиОС</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/AccumulationRegisters/СтоимостьОС/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПодготовитьДанныеДляФормированияЗаданийПередЗаписью();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьДанныеДляФормированияЗаданийПриЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьДанныеДляФормированияЗаданийПередЗаписью()

	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПередЗаписью.Период КАК Период,
	|	ТаблицаПередЗаписью.Организация КАК Организация,
	|	ТаблицаПередЗаписью.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаПередЗаписью.Подразделение КАК Подразделение,
	|	ТаблицаПередЗаписью.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ТаблицаПередЗаписью.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаПередЗаписью.Арендатор КАК Арендатор,
	|	ТаблицаПередЗаписью.Стоимость КАК Стоимость,
	|	ТаблицаПередЗаписью.СтоимостьРегл КАК СтоимостьРегл,
	|	ТаблицаПередЗаписью.СтоимостьНУ КАК СтоимостьНУ,
	|	ТаблицаПередЗаписью.СтоимостьПР КАК СтоимостьПР,
	|	ТаблицаПередЗаписью.СтоимостьВР КАК СтоимостьВР,
	|	ТаблицаПередЗаписью.СтоимостьЦФ КАК СтоимостьЦФ,
	|	ТаблицаПередЗаписью.СтоимостьНУЦФ КАК СтоимостьНУЦФ,
	|	ТаблицаПередЗаписью.СтоимостьПРЦФ КАК СтоимостьПРЦФ,
	|	ТаблицаПередЗаписью.СтоимостьВРЦФ КАК СтоимостьВРЦФ,
	|	ТаблицаПередЗаписью.НеУчитываемаяСтоимостьНУ КАК НеУчитываемаяСтоимостьНУ,
	|	ТаблицаПередЗаписью.АмортизационнаяПремия КАК АмортизационнаяПремия,
	|	ТаблицаПередЗаписью.РезервПереоценкиСтоимости КАК РезервПереоценкиСтоимости,
	|	ТаблицаПередЗаписью.РезервПереоценкиСтоимостиРегл КАК РезервПереоценкиСтоимостиРегл,
	|	ТаблицаПередЗаписью.ПриростСтоимости КАК ПриростСтоимости,
	|	ТаблицаПередЗаписью.ПриростСтоимостиРегл КАК ПриростСтоимостиРегл,
	|	ТаблицаПередЗаписью.ЗалоговаяСтоимость КАК ЗалоговаяСтоимость,
	|	ТаблицаПередЗаписью.ПредварительнаяСтоимость КАК ПредварительнаяСтоимость,
	|	ТаблицаПередЗаписью.ПредварительнаяСтоимостьРегл КАК ПредварительнаяСтоимостьРегл,
	|	ТаблицаПередЗаписью.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаПередЗаписью.ВидДвижения КАК ВидДвижения,
	|	ТаблицаПередЗаписью.АналитикаКапитализацииРасходов КАК АналитикаКапитализацииРасходов,
	|	ТаблицаПередЗаписью.ВидАналитикиКапитализацииРасходов КАК ВидАналитикиКапитализацииРасходов,
	|	ТаблицаПередЗаписью.ВариантПримененияЦелевогоФинансирования КАК ВариантПримененияЦелевогоФинансирования,
	|	ТаблицаПередЗаписью.ОтражатьВРеглУчете КАК ОтражатьВРеглУчете,
	|	ТаблицаПередЗаписью.ОтражатьВУпрУчете КАК ОтражатьВУпрУчете
	|ПОМЕСТИТЬ СтоимостьОСПередЗаписью
	|ИЗ
	|	РегистрНакопления.СтоимостьОС КАК ТаблицаПередЗаписью
	|ГДЕ
	|	ТаблицаПередЗаписью.Регистратор = &Регистратор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляФормированияЗаданийПриЗаписи()
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив;
	ТекстЗапросаИзменения = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Период             КАК Период,
	|	Таблица.Организация        КАК Организация,
	|	Таблица.ОсновноеСредство   КАК ОсновноеСредство,
	|	Таблица.ОтражатьВРеглУчете КАК ОтражатьВРеглУчете,
	|	Таблица.ОтражатьВУпрУчете  КАК ОтражатьВУпрУчете,
	|	&Регистратор               КАК Документ
	|ПОМЕСТИТЬ СтоимостьОСИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПередЗаписью.Период              КАК Период,
	|		ТаблицаПередЗаписью.Организация         КАК Организация,
	|		ТаблицаПередЗаписью.ОсновноеСредство    КАК ОсновноеСредство,
	|		ТаблицаПередЗаписью.ОтражатьВРеглУчете  КАК ОтражатьВРеглУчете,
	|		ТаблицаПередЗаписью.ОтражатьВУпрУчете   КАК ОтражатьВУпрУчете
	|	ИЗ
	|		СтоимостьОСПередЗаписью КАК ТаблицаПередЗаписью
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК ТаблицаПриЗаписи
	|			ПО ТаблицаПриЗаписи.ОсновноеСредство = ТаблицаПередЗаписью.ОсновноеСредство
	|				И ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация
	|				И ТаблицаПриЗаписи.Подразделение = ТаблицаПередЗаписью.Подразделение
	|				И ТаблицаПриЗаписи.ГруппаФинансовогоУчета = ТаблицаПередЗаписью.ГруппаФинансовогоУчета
	|				И ТаблицаПриЗаписи.НаправлениеДеятельности = ТаблицаПередЗаписью.НаправлениеДеятельности
	|				И ТаблицаПриЗаписи.Арендатор = ТаблицаПередЗаписью.Арендатор
	|				И ТаблицаПриЗаписи.Регистратор = &Регистратор
	|		ГДЕ
	|			(ТаблицаПриЗаписи.Период ЕСТЬ NULL
	|				ИЛИ ТаблицаПриЗаписи.Период <> ТаблицаПередЗаписью.Период
	|				ИЛИ ТаблицаПриЗаписи.Стоимость <> ТаблицаПередЗаписью.Стоимость
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьРегл <> ТаблицаПередЗаписью.СтоимостьРегл
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьНУ <> ТаблицаПередЗаписью.СтоимостьНУ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьПР <> ТаблицаПередЗаписью.СтоимостьПР
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьВР <> ТаблицаПередЗаписью.СтоимостьВР
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьЦФ <> ТаблицаПередЗаписью.СтоимостьЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьНУЦФ <> ТаблицаПередЗаписью.СтоимостьНУЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьПРЦФ <> ТаблицаПередЗаписью.СтоимостьПРЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьВРЦФ <> ТаблицаПередЗаписью.СтоимостьВРЦФ
	|				ИЛИ ТаблицаПриЗаписи.НеУчитываемаяСтоимостьНУ <> ТаблицаПередЗаписью.НеУчитываемаяСтоимостьНУ
	|				ИЛИ ТаблицаПриЗаписи.АмортизационнаяПремия <> ТаблицаПередЗаписью.АмортизационнаяПремия
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимость <> ТаблицаПередЗаписью.ПредварительнаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.РезервПереоценкиСтоимости <> ТаблицаПередЗаписью.РезервПереоценкиСтоимости
	|				ИЛИ ТаблицаПриЗаписи.РезервПереоценкиСтоимостиРегл <> ТаблицаПередЗаписью.РезервПереоценкиСтоимостиРегл
	|				ИЛИ ТаблицаПриЗаписи.ПриростСтоимости <> ТаблицаПередЗаписью.ПриростСтоимости
	|				ИЛИ ТаблицаПриЗаписи.ПриростСтоимостиРегл <> ТаблицаПередЗаписью.ПриростСтоимостиРегл
	|				ИЛИ ТаблицаПриЗаписи.ЗалоговаяСтоимость <> ТаблицаПередЗаписью.ЗалоговаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимость <> ТаблицаПередЗаписью.ПредварительнаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимостьРегл <> ТаблицаПередЗаписью.ПредварительнаяСтоимостьРегл)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаПриЗаписи.Период,
	|		ТаблицаПриЗаписи.Организация,
	|		ТаблицаПриЗаписи.ОсновноеСредство,
	|		ТаблицаПриЗаписи.ОтражатьВРеглУчете,
	|		ТаблицаПриЗаписи.ОтражатьВУпрУчете
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК ТаблицаПриЗаписи
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОСПередЗаписью КАК ТаблицаПередЗаписью
	|			ПО ТаблицаПриЗаписи.ОсновноеСредство = ТаблицаПередЗаписью.ОсновноеСредство
	|				И ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация
	|				И ТаблицаПриЗаписи.Подразделение = ТаблицаПередЗаписью.Подразделение
	|				И ТаблицаПриЗаписи.ГруппаФинансовогоУчета = ТаблицаПередЗаписью.ГруппаФинансовогоУчета
	|				И ТаблицаПриЗаписи.НаправлениеДеятельности = ТаблицаПередЗаписью.НаправлениеДеятельности
	|				И ТаблицаПриЗаписи.Арендатор = ТаблицаПередЗаписью.Арендатор
	|		ГДЕ
	|			(ТаблицаПередЗаписью.Период ЕСТЬ NULL
	|				ИЛИ ТаблицаПриЗаписи.Период <> ТаблицаПередЗаписью.Период
	|				ИЛИ ТаблицаПриЗаписи.Стоимость <> ТаблицаПередЗаписью.Стоимость
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьРегл <> ТаблицаПередЗаписью.СтоимостьРегл
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьНУ <> ТаблицаПередЗаписью.СтоимостьНУ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьПР <> ТаблицаПередЗаписью.СтоимостьПР
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьВР <> ТаблицаПередЗаписью.СтоимостьВР
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьЦФ <> ТаблицаПередЗаписью.СтоимостьЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьНУЦФ <> ТаблицаПередЗаписью.СтоимостьНУЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьПРЦФ <> ТаблицаПередЗаписью.СтоимостьПРЦФ
	|				ИЛИ ТаблицаПриЗаписи.СтоимостьВРЦФ <> ТаблицаПередЗаписью.СтоимостьВРЦФ
	|				ИЛИ ТаблицаПриЗаписи.НеУчитываемаяСтоимостьНУ <> ТаблицаПередЗаписью.НеУчитываемаяСтоимостьНУ
	|				ИЛИ ТаблицаПриЗаписи.АмортизационнаяПремия <> ТаблицаПередЗаписью.АмортизационнаяПремия
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимость <> ТаблицаПередЗаписью.ПредварительнаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.РезервПереоценкиСтоимости <> ТаблицаПередЗаписью.РезервПереоценкиСтоимости
	|				ИЛИ ТаблицаПриЗаписи.РезервПереоценкиСтоимостиРегл <> ТаблицаПередЗаписью.РезервПереоценкиСтоимостиРегл
	|				ИЛИ ТаблицаПриЗаписи.ПриростСтоимости <> ТаблицаПередЗаписью.ПриростСтоимости
	|				ИЛИ ТаблицаПриЗаписи.ПриростСтоимостиРегл <> ТаблицаПередЗаписью.ПриростСтоимостиРегл
	|				ИЛИ ТаблицаПриЗаписи.ЗалоговаяСтоимость <> ТаблицаПередЗаписью.ЗалоговаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимость <> ТаблицаПередЗаписью.ПредварительнаяСтоимость
	|				ИЛИ ТаблицаПриЗаписи.ПредварительнаяСтоимостьРегл <> ТаблицаПередЗаписью.ПредварительнаяСтоимостьРегл)
	|			И ТаблицаПриЗаписи.Регистратор = &Регистратор
	|
	|	) КАК Таблица
	|";
	МассивТекстовЗапроса.Добавить(ТекстЗапросаИзменения);
	
	ТекстЗапросаЗаданияКРасчетуСтоимости =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Период           КАК Период,
	|	Таблица.Организация      КАК Организация,
	|	Таблица.АналитикаКапитализацииРасходов КАК ОбъектУчета,
	|	&Регистратор             КАК Документ
	|ПОМЕСТИТЬ СтоимостьОС_ЗаданияКРасчетуСтоимостиВНАИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПередЗаписью.Период            КАК Период,
	|		ТаблицаПередЗаписью.Организация       КАК Организация,
	|		ТаблицаПередЗаписью.АналитикаКапитализацииРасходов  КАК АналитикаКапитализацииРасходов
	|	ИЗ
	|		СтоимостьОСПередЗаписью КАК ТаблицаПередЗаписью
	|	ГДЕ
	|		ТаблицаПередЗаписью.ХозяйственнаяОперация В (
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС), 
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуУзловКомпонентовАмортизации),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОСЧастичная),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеНДС))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаПриЗаписи.Период,
	|		ТаблицаПриЗаписи.Организация,
	|		ТаблицаПриЗаписи.АналитикаКапитализацииРасходов
	|	ИЗ
	|		РегистрНакопления.СтоимостьОС КАК ТаблицаПриЗаписи
	|	ГДЕ
	|		ТаблицаПриЗаписи.Регистратор = &Регистратор
	|		И ТаблицаПриЗаписи.ХозяйственнаяОперация В (
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС), 
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуУзловКомпонентовАмортизации),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуПредметовАренды),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОСЧастичная),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеНДС))
	|	) КАК Таблица
	|";
	МассивТекстовЗапроса.Добавить(ТекстЗапросаЗаданияКРасчетуСтоимости);
	МассивТекстовЗапроса.Добавить("УНИЧТОЖИТЬ СтоимостьОСПередЗаписью");
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства,
		"СтоимостьОСИзменение", Выборка.Следующий() И Выборка.Количество > 0);
	
	Выборка = Результат[1].Выбрать();
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства,
		"СтоимостьОС_ЗаданияКРасчетуСтоимостиВНАИзменение", Выборка.Следующий() И Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
